Revit 2027 API
DWGExportOptions.GetPredefinedOptions Method
 Returns an instance DWGExportOptions containing settings from a predefined export setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DWGExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
Public Shared Function GetPredefinedOptions (
	document As Document,
	setup As String
) As DWGExportOptions
public:
static DWGExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
static member GetPredefinedOptions :
        document : Document *
        setup : string -> DWGExportOptions
Parameters
document Document
 A Revit project document to retrieve the setup from.
setup String
 The name of a predefined export setup from the specified document.
Return Value
DWGExportOptions
 An instance of predefined DWGExportOptions, or null if the name was not found.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWGExportOptions Class
Autodesk.Revit.DB Namespace